# 복합연산자 
'''a = 2

a += 3 #            a = a+3
a -= 3 #            a = a-3
a *= 3 #            a = a*3

print(a)
'''
# 복합연산자는 기존의 값이 정의되어 있을 때 사용 가능!!
#a부터 b 까지의 합을 구하려면, 초기 변수를 0으로 설정해야 가능하다!!!

'''
s = 0  #초기 변수 s 를 0으로 설정!
for i in range(1,101):  # 0부터 100까지 반복
    print(s, "+", i,"=", end = "") 
    s+=i                # 0부터 100까지 1씩 증가하며 더함
print(s)
'''


'''n = int(input("1부터 입력하는 수까지 더해줄게요: "))
s=0
for i in range(1,n+1):
    s+=i
print(s)'''

#factorial 프로그램

'''
N= int(input("팩토리얼 구해드립니다. : "))
#N! = N*N-1*N-2

s = 1
for i in range(1,N+1):
    s*=i                    #s = s*1    
                            #s = s*1*s*2 
print(s)                    #s = s*1*s*2*s*3 
'''            
'''
#3! = 3* 3-1
# 
print("홀짝 구하기!")
N = int(input())
for i in range(1,N+1):
    if i%2 == 0:
        print(i,"짝")
    else:
        print(i,"홀")
        
# 조건문의 확장!!
# if N%2 == 0:
#     print(N,"짝")
# else:
#     print(N,"홀")
print("홀짝을 더해줌!")
N = int(input())
jj = 0 #홀수 복합연산 초기화
h = 0  #짝수 복합연산 초기화
for i in range(1,N+1):
    if i%2 == 0:
        jj+=i
        print(i,jj)# 짝수일 때 더해라
    else:
        h+=i
        print(i,h)# 홀수일 때 더해라


print("홀짝 개수 구하기!")
#s+=1 은 개수를 구하는 공식이다!!!
N = int(input())
jj = 0 #홀수 복합연산 초기화
h = 0  #짝수 복합연산 초기화
for i in range(1,N+1):
    if i%2 == 0:
        jj+=1
        print(i,jj)# 짝수일 때 더해라
    else:
        h+=1
        print(i,h)# 홀수일 때 더해라
        '''

'''n = int(input("입력: "))
for i in range(1,n+1):
    if i%3==0:
        print("3의 배수: ", i)   



# n = int(input("입력: "))
ttt = []
for i in range(1,n+1):
    if i%3 ==0:
        ttt.append(i)
    print("3의 배수:", ttt)'''

# i*= 숫자 == 숫자개수만큼 연산!!!

#1. 3의 배수를 리스트에 담는다. 
#2.



'''
n = int(input("입력: "))
ttt = []
for i in range(1,n+1):
    if i%3 ==0:
        ttt.append(i)
    print("3의 배수:", ttt)

#print
[3,6,9]


#   print
[3]
[3,6]
[3,6,9]

#       print
[]
[]
[3]
[3]
[3]
[3,6]
[3,6]
[3,6]
[3,6,9]
[3,6,9]
'''

'''
li = ["D","A","B","C"]  #i%4 == 0,1,2,3  <====이거 인덱스로 활용 가능
for i in [7,13,25,30,34,49,78,80]:  #원하는 정보만 리스트로 만들면 간단함!
    print(i,li[i%4])# 20%4 ==0  ==> 0번째 인덱스
'''
# 21%4 == 1 이니까 1번 인덱스 A 출력!!!





'''리스트와 관련지어서 조금더 간단한 식으로 바꿀수있지 않을까요!! 잘생각해보세욥

HINT : i%4  가  0 1 2 3 나옵니다 이게 인덱스로 활용될수도있어요!!'''


#1000년부터 5000년


# y = 1000~5000

'''s = 0
for i in range(1000,5001):
    if i%4==0 and i%100!=0 or i%400==0:
        s+=1
print(s,"번!")'''








'''
Q1. 1에서 N 까지 7 의 배수의 합과 개수를 구하는 코드를 작성하세요.
'''

'''
n = int(input())
s=0
k=0
for i in range(1,n+1):
    if i%7==0:
        s+=i
        k+=1
print(s,k)
'''
        

'''
Q2. 1에서 N 까지 짝수의 합과 홀수의 합을 구하세요.
'''
'''
n = int(input())
hol = []
jjak= [] 
hs=0
js=0
for i in range(1,n+1):
    if i%2==0:
        js+=i
        jjak.append(i)
    if i%2==1:
        hs+=0
        hol.append(i)

print("홀수 합:",sum(hol),"짝수 합:",sum(jjak))
'''










'''
Q3. 1에서 N 까지 3의 배수의 개수와 5의 배수의 개수의 차를 구하세요.
'''
'''
sam = 0
oo = 0
n = int(input())
for i in range(1,n+1):
    if i%3==0:
        sam+=1
    if i%5==0:
        oo+=1
print(sam-oo)
'''






'''
Q4. 한 반 학생들의 혈액형입니다. A, B, AB, O 형이 각각 몇명인지 프로그래밍 하세요. 
'''
li = ['O', 'O', 'O', 'O', 'AB', 'B', 'A', 'A', 'O', 'AB', 'B', 'A', 'B', 'AB', 'AB', 'AB', 'O', 'A', 'A', 'AB', 'B', 'AB', 'O', 'B', 'A', 'O', 'A', 'O', 'AB', 'O', 'AB', 'AB', 'O', 'B', 'B', 'O', 'O', 'AB', 'B', 'A']
# a=0
# b=0
# o=0
# ab=0


# for i in li:
#     if i=='A':
#         a+=1
#     if i=='B':
#         b+=1
#     if i=='O':
#         o+=1
#     if i=='AB':
#         ab+=1

# print(a,b,o,ab)
    

'''
for i in ['A','B','O','AB']:
    if i =='A':
        print("a:",li.count(i))
    if i =='B':
        print("b:",li.count(i))
    if i =='o':
        print("o:",li.count(i))
    if i =='AB':
        print("ab:",li.count(i))
        '''

'''
li = ['O', 'O', 'O', 'O', 'AB', 'B', 'A', 'A', 'O', 'AB', 'B', 'A', 'B', 'AB', 'AB', 'AB', 'O', 'A', 'A', 'AB', 'B', 'AB', 'O', 'B', 'A', 'O', 'A', 'O', 'AB', 'O', 'AB', 'AB', 'O', 'B', 'B', 'O', 'O', 'AB', 'B', 'A']
for i in li:
    if i =="A":
        print(li.count('0'))

for i in ['A','B','AB','O']:
    print(i, li.count(i))


['O', 'O', 'O', 'O', 'AB', 'B', 'A', 'A', 'O', 'AB', 'B', 'A', 'B', 'AB', 'AB', 'AB', 'O', 'A', 'A', 'AB', 'B', 'AB', 'O', 'B', 'A', 'O', 'A', 'O', 'AB', 'O', 'AB', 'AB', 'O', 'B', 'B', 'O', 'O', 'AB', 'B', 'A']

 
'''





'''
Q5. 현재 당신은 5000 원이 있습니다. 편의점에 있는 물품들의 가격들이 다음과 같습니다. 
구매가능한 물품의 개수를 구하세요.

[6600, 4800, 3400, 3200, 4500, 5500, 3200, 7800, 4200, 5300, 7500, 4200, 7200, 5600, 6700, 8000, 7000, 6700, 6200, 6100, 4700, 7200, 7100, 5700, 5900, 4300, 5200, 5600, 5900, 6600, 4900, 5800, 7100, 5800, 4500, 3200, 7800, 5300, 7200, 8000]
'''
'''s=0
li = [6600, 4800, 3400, 3200, 4500, 5500, 3200, 7800, 4200, 5300, 7500, 4200, 7200, 5600, 6700, 8000, 7000, 6700, 6200, 6100, 4700, 7200, 7100, 5700, 5900, 4300, 5200, 5600, 5900, 6600, 4900, 5800, 7100, 5800, 4500, 3200, 7800, 5300, 7200, 8000]
for i in li:
    if i <=5000:
        s+=1
print(s)'''


'''
li = [6600, 4800, 3400, 3200, 4500, 5500, 3200, 7800, 4200, 5300, 7500, 4200, 7200, 5600, 6700, 8000, 7000, 6700, 6200, 6100, 4700, 7200, 7100, 5700, 5900, 4300, 5200, 5600, 5900, 6600, 4900, 5800, 7100, 5800, 4500, 3200, 7800, 5300, 7200, 8000]

s=0
for i in li:  #[6600, 4800, 3400, 3200, 4500, 5500, 3200, 7800, 4200, 5300, 7500, 4200, 7200, 5600, 6700, 8000, 7000, 6700, 6200, 6100, 4700, 7200, 7100, 5700, 5900, 4300, 5200, 5600, 5900, 6600, 4900, 5800, 7100, 5800, 4500, 3200, 7800, 5300, 7200, 8000]:
    if i<=5000:
        s+=1
print(s)    
'''










 
'''
Q6. 한 반 학생들의 국어 점수이다. 80점 미만은 보충수업을 받아야한다고 했을 때, 보충수업 대상자는 몇명일까?
[80, 70, 44, 66, 40, 80, 77, 57, 68, 90, 75, 84, 99, 52, 45, 53, 54, 96, 59, 47, 57, 68, 74, 68, 79, 60, 63, 67, 43, 100, 43, 54, 77, 59, 75, 60, 97, 47, 100, 54]
'''
'''
li = [80, 70, 44, 66, 40, 80, 77, 57, 68, 90, 75, 84, 99, 52, 45, 53, 54, 96, 59, 47, 57, 68, 74, 68, 79, 60, 63, 67, 43, 100, 43, 54, 77, 59, 75, 60, 97, 47, 100, 54]
s = 0
for i in li:
    if i > 80:
        s+=1   
print(s)
'''


'''
★Q7. 다음 수들의 절대값의 합을 구해주세요. 
(절대값은 0과의 떨어져있는 정도를 나타내는 값입니다.)
[-230, -139, 154, 471, 343, -285, -272, -358, 171, 433, 492, 213, 458, -324, 266, -441, -283, 196, 452, -273, 349, -435, 256, 263, 440, -308, -338, 255, -325, 155, 429, -244, -477, -293, 265, 446, -320, 331, -371, 267, -167, 315, -224, 365, -112, 274, 338, 120, 344, -303, 203, -308, -458, -189, 100, 343, -264, -334, -227, -328, 133, 153, -259, -252, 233, -357, -122, 174, 431, -212, 128, 180, -294, -239, 208, -404, -493, 405, -238, -460, -264, -161, 187, 320, -323, 100, 473, 258, -211, -148, 187, -188, -117, -164, -122, 254, 454, -180, 377, 469]
 '''
# s=0
# li = [-230, -139, 154, 471, 343, -285, -272, -358, 171, 433, 492, 213, 458, -324, 266, -441, -283, 196, 452, -273, 349, -435, 256, 263, 440, -308, -338, 255, -325, 155, 429, -244, -477, -293, 265, 446, -320, 331, -371, 267, -167, 315, -224, 365, -112, 274, 338, 120, 344, -303, 203, -308, -458, -189, 100, 343, -264, -334, -227, -328, 133, 153, -259, -252, 233, -357, -122, 174, 431, -212, 128, 180, -294, -239, 208, -404, -493, 405, -238, -460, -264, -161, 187, 320, -323, 100, 473, 258, -211, -148, 187, -188, -117, -164, -122, 254, 454, -180, 377, 469]
# for i in li:
#     s+=abs(i)

# print(s)
# s=0
# for i in li:
#     if i <0:
#         i*=-1
#     s+=i
# print(s)

# s=0
# for i in [-230, -139, 154, 471, 343, -285, -272, -358, 171, 433, 492, 213, 458, -324, 266, -441, -283, 196, 452, -273, 349, -435, 256, 263, 440, -308, -338, 255, -325, 155, 429, -244, -477, -293, 265, 446, -320, 331, -371, 267, -167, 315, -224, 365, -112, 274, 338, 120, 344, -303, 203, -308, -458, -189, 100, 343, -264, -334, -227, -328, 133, 153, -259, -252, 233, -357, -122, 174, 431, -212, 128, 180, -294, -239, 208, -404, -493, 405, -238, -460, -264, -161, 187, 320, -323, 100, 473, 258, -211, -148, 187, -188, -117, -164, -122, 254, 454, -180, 377, 469]:
#     s+=abs(i)
# print(s)

# s=0
# # i *= -1  =====>양수로 바꿔줌!
# for i in li:
#   if i <0:
#       i *= -1
#   s+=i
# print(s)


'''
★Q8. 단을 입력받고, 구구단을 출력하는 코드를 작성하세요.(하나의단만)
ex ) 단입력 : 3
     3 x 1 = 3
     3 x 2 = 6
        ...
     3 x 9 = 27
'''
'''
n = int(input("몇단?"))
for i in range(1,10):
    print(n, "*", i,"=", n*i)
'''